Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ПроведениеСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеСобеседования</name>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>ТипСобеседования</name>
    <type>
      <types>EnumRef.ТипыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСобеседования</name>
    <type>
      <types>EnumRef.СтатусыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КандидатУведомлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСобеседования</name>
    <type>
      <types>EnumRef.РезультатыСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеЛицаЗаСобеседование</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда	
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		СтрокаТЧ = Объект.ОтветственныеЛицаЗаСобеседование.Добавить();
		СтрокаТЧ.Ответственный = ТекущийПользователь.Сотрудник;
		СтрокаТЧ.Должность = ТекущийПользователь.Сотрудник.Должность; 
		Объект.АвторДокумента = ТекущийПользователь;
	КонецЕсли;
	
КонецПроцедуры
